<?php
return [
	'plugin' => [
		'name' => 'Сторінки'
	],
	'page' => [
		'fields' => [
			'id' => 'ID',
			'title' => 'Назва',
			'slug' => 'Посилання',
			'content' => 'Контент',
			'link_url' => 'Адреса Посилання',
			'link_target' => 'Атрибут Target',
			'meta_title' => 'Мета Заголовок',
			'meta_description' => 'Мета Описання',
			'published' => 'Опубліковано',
			'navigation_hidden' => 'Приховати з навігації',
			'components' => 'Компоненти',
			'sections' => 'Секції',
			'layout' => 'Шаблон',
			'sluggable' => 'Динамічне посилання',
			'parent_id' => 'Батьківська сторінка',
			'preview' => 'Перегляд',
			'layout_content' => 'Шаблон',
			'og' => [
				'image' => 'Open Graph зображення'
			],
            'denied_users' => 'Заборонити доступ користувачів до сторінки',
            'granted_users' => 'Дозволити доступ користувачів до сторінки',
            'searchable' => 'Виводити в пошуку'
		],
		'childs_not_found' => 'Немає дочірніх сторінок',
		'tabs' => [
			'main' => 'Головне',
			'options' => 'Опції',
			'seo' => 'Сео',
			'builder' => 'Контент',
			'childs' => 'Дочірні сторінки',
            'access' => 'Доступ',
		],
	],
	'pages' => [
		'name' => 'Сторінки',
		'create' => 'Нова Сторінка',
		'update' => 'Оновити Сторінку',
		'preview' => 'Передогляд Сторінки',
		'manage' => 'Управління Сторінками',
		'create_btn' => 'Створити',
		'create_and_close_btn' => 'Створити та Закрити',
		'save_btn' => '<u>З</u>берегти',
		'save_and_close_btn' => 'Зберегти та Закрити',
		'or' => 'або',
		'cancel' => 'Скасувати',
		'delete_confirm' => 'Ви впевнені що бажаєте видалити вибрані сторінки?',
		'delete_selected' => 'Видалити вирані',
		'reorder' => 'Перевпорядкувати сторінки',
		'return_pages' => 'Повернутися до сторінок',
		'before_save' => 'Будь ласка збережіть публікацію перед завантаженням медіа'
	],
	'menu' => [
		'name' => 'Меню',
		'return_to_list' => 'Повернутися до списку пунктів меню',
		'index' => 'Меню',
		'add_item' => 'Додати меню',
		'reorder_items' => 'Змінити порядок',
		'delete_confirm' => 'Ви впевнені що бажаєте видалити вибрані элементи?',
		'delete' => 'Видалити',
		'manage' => 'Управління Меню',
		'save_before_use_relation' => 'Будь ласка, сбережіть, перед використанням',
		'reorder' => 'Змінити порядок',
		'fields' => [
			'id' => 'ID',
			'name' => 'Ім\'я',
			'code' => 'Код',
			'title' => 'Назва',
			'items' => 'Елементи'
		],
		'tabs' => [
			'main' => 'Головне',
		],
		'items' => 'Пункт Меню'
	],
	'menuitems' => [
		'add_item' => 'Створити Меню',
		'return' => 'Повернутися до списку пунктів меню',
		'reorder' => 'Змінити порядок',
		'fields' => [
            'code' => 'Код',
            'title' => 'Назва',
			'type' => 'Тип',
			'isHidden' => 'Прихований',
			'isExternal' => 'Зовнішній лінк',
			'value' => 'Значення',
			'value_link' => 'Посилання',
			'icon' => 'Іконка'
		],
		'types' => [
			'header' => 'Заголовок',
			'link' => 'Посилання',
			'page' => 'Сторінка',
			'cmsPage' => 'Cms Сторінка',
		]
	],
	'components' => [
		'menu' => [
			'name' => 'Меню',
			'description' => 'Компонента Меню',
		],
		'page' => [
			'name' => 'Сторінка',
			'description' => 'Компонента Сторінки',
		],
        'lastPages' => [
            'name' => 'Блок останніх сторінок',
            'description' => 'Компонента останніх створених сторінок',
            'fields' => [
                'count' => 'Кількість',
                'label' => 'Надпис "Останні сторінки"',
                'buttonLabel' => 'Надпис "Усі сторінки"',
                'buttonLink' => 'Посилання',
            ],
            'mainTab' => 'Властивості',
        ],
		'plugin_name' => 'Назва Плагіну',
		'name' => 'Компоненти',
		'new_component' => 'Нова Компонента',
		'add' => 'Створити Компоненту',
		'return_to_components' => 'Повернутися до Компонент',
		'edit' => 'Редагувати',
		'reorder' => 'Відсортувати Компоненти',
		'manage' => 'Управління Компонентами',
		'fields' => [
			'name' => 'Ім\'я',
			'alias' => 'Псевдонім',
		],
		'tabs' => [
			'properties' => 'Властивості',
		]
	],
	'return_to_page' => 'Повернутися до Сторінки',
	'sections' => [
		'new' => 'Нова Секція',
		'add' => 'Додати Секцію',
		'reorder' => 'Відсортувати Секції',
		'fields' => [
			'name' => 'Код',
			'title' => 'Назва'
		]
	],
	'partials' => [
		'name' => 'Секції',
		'new' => 'Нова Секція',
		'create' => 'Створити Секцію',
		'edit' => 'Редагувати Секцію',
		'manage' => 'Управління Секціями',
		'fields' => [
			'title' => 'Назва',
			'code' => 'Код',
		]
	],
	'backend_toolbar' => [
		'edit' => 'Редагувати'
	],
    'permissions' => [
        'pages' => [
            'index'  => 'Доступ до Сторінок',
            'create' => 'Доступ до створення Сторінок',
            'delete' => 'Доступ до видалення системних Сторінок',
            'isSystemFields' => 'Доступ до редагування полів системних Cторінок',
        ],
        'menu' => [
            'index'  => 'Доступ до Меню',
            'create' => 'Доступ до створення Меню',
        ],
        'partials' => [
            'index'  => 'Доступ до Фрагментів',
            'create' => 'Доступ до створення Фрагментів',
        ],
        'components' => [
            'create' => 'Доступ до створення Компонентів',
        ],
        'sections' => [
            'create' => 'Доступ до створення Секцій',
        ],
    ],
];