<?php

return [
    'plugin' => [
        'name' => 'Опитування',
    ],
    'side_menu' => [
        'polls' => 'Опитування',
        'questions' => 'Запитання',
        'answers' => 'Відповіді',
        'locations' => 'Локації',
        'departments' => 'Департаменти',
    ],
    'access' => [
        'manage_polls' => 'Керування опитуваннями',
        'manage_questions' => 'Керування запитаннями',
        'manage_answers' => 'Керування відповідями',
        'manage_locations' => 'Керування локаціми',
        'manage_departments' => 'Керування департаментами',
        'access_import' => 'Імпортування'
    ],
    'validate' => [
        'different_actions' => 'Для мультивибору відповідей, їх наступні кроки мають бути однаковими',
        'different_questions' => 'Для мультивибору відповідей, їх наступні запитання мають бути однаковими',
        'different_answers' => 'Для мультивибору відповідей, їх наступні відповіді мають бути однаковими',
        'parent_questions_count' => 'Виникла помилка, відповіть використовується в більше ніж одному запитанні.'
    ]
];